# Задача №2
# Написать точно такую же процедуру, но в декларативном стиле

def sort_list_declarative(numbers):
    numbers.sort(reverse=True)


lst = [5, 6, 1, 7, 2, 5]
sort_list_declarative(lst)
print()
